src/cfe/InformationRegisters/ЗамерыВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ЗамерыВремени</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/APDEXMetrics.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>APDEXMetrics</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>KeyOperationTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TotalAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>EditStamp</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>KeyOperation</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючевыеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>APDEXbucket</Name>
					<Type>
						<v8:Type>cfg:EnumRef.APDEXBuckets</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/ЗамерыВремени/Ext/RecordSetModule.bsl
// Выгрузка метрик в Prometheus: удобный HTTP-клиент для 1С:Предприятие 8
//
// Copyright 2021 Valentin Kozlov
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
//
// URL: https://github.com/ValentinKozlov/1C_PrometheusExporter
// e-mail: i_frog@mail.ru
// Версия: 0.0.1
// Требования: платформа 1С версии 8.3.17 и выше

Функция ПолучитьСписокБакетов() 
	
	//Лучше переделать на справочник, так как бакеты могут меняться, но пока руки не дошли
	
	Попытка 
		СписокЗначенийПеречисления = Новый СписокЗначений;	 

		// Прочитать значения перечисления из базы данных 
		Запрос = Новый Запрос;

		Запрос.Текст = "
		|ВЫБРАТЬ
		|   APDEXBuckets.Ссылка КАК Ссылка,   
		|   ПРЕДСТАВЛЕНИЕ(APDEXBuckets.Ссылка) КАК ПредставлениеЗначения
		|ИЗ
		|   Перечисление.APDEXBuckets КАК APDEXBuckets";

		Результат = Запрос.Выполнить();	
		Выборка = Результат.Выбрать(); 
		Пока Выборка.Следующий() Цикл
			// Заполнить значения списка
			СписокЗначенийПеречисления.Добавить(Выборка.Ссылка,Выборка.ПредставлениеЗначения);
		КонецЦикла;
		
		Возврат СписокЗначенийПеречисления;
		
	Исключение  		
		ИмяСобытия = "Функция МодульНабораЗаписей.ПолучитьЗначенияПеречисления'";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,ЭтотОбъект.Метаданные(),,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

		Возврат 0;
	КонецПопытки		
	
КонецФункции


Функция ПолучитьТекущееЗначениеМетрикПоОперации(Знач КлючеваяОперация) 
    Попытка
		Запрос = Новый Запрос; 
		
		Запрос.Текст = 
			"ВЫБРАТЬ			
			|	APDEXMetrics.APDEXbucket КАК APDEXbucket,
			|	APDEXMetrics.Amount КАК Amount,
			|	APDEXMetrics.KeyOperationTime КАК KeyOperationTime,
			|	APDEXMetrics.TotalAmount КАК TotalAmount
			|ИЗ
			|	РегистрСведений.APDEXMetrics КАК APDEXMetrics
			|ГДЕ
			|	APDEXMetrics.KeyOperation = &КлючеваяОперация
			|
			|УПОРЯДОЧИТЬ ПО
			|	APDEXbucket АВТОУПОРЯДОЧИВАНИЕ			
			|";
		
		Запрос.УстановитьПараметр("КлючеваяОперация", КлючеваяОперация);
		
		РезультатЗапроса = Запрос.Выполнить();
		ТабЗначРезультатЗапроса = РезультатЗапроса.Выгрузить();
		
		Возврат ТабЗначРезультатЗапроса; 
		
	Исключение  
		
		ИмяСобытия = "Функция МодульНабораЗаписей.ПолучитьТекущееЗначениеМетрикПоОперации";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,ЭтотОбъект.Метаданные(),,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат 0;
		
	КонецПопытки	
КонецФункции


&После("ПриЗаписи")
 Процедура Prometeus_ПриЗаписи(Отказ, Замещение)   //что значат параметры?
		
	//Согласно задаче для формирования регистра с метриками типа "histogram" требуется получать данные нарастающим итогом по всем замерам.
	//Для этого используется регистр сведений и в нем всегда считается только одна последняя операция, чтобы при росте количества данных,
	//запрос выполнялся быстро.	
	
	СписокЗначенийПеречисления = ПолучитьСписокБакетов();
	Если СписокЗначенийПеречисления = 0 Тогда
		Возврат;
	КонецЕсли;             
	
	Для Каждого ЗаписьЗамера Из ЭтотОбъект Цикл
		
		КлючеваяОперация = ЗаписьЗамера.КлючеваяОперация;
		ТабЗначРезультатЗапроса = ПолучитьТекущееЗначениеМетрикПоОперации(КлючеваяОперация);
		
		Если ТабЗначРезультатЗапроса=0 Тогда 
			Возврат;
		КонецЕсли;
						
		//Формируем запись в регистр сведений для расчета и отправки метрики histogram в Prometheus		
		ПерваяЗапись = Истина;
		
		Для Каждого bucket Из СписокЗначенийПеречисления Цикл 
			BuketTime = Число(bucket.Представление);			
			//В регистр пишем все бакеты, даже нулевые, иначе APDEX в Grafana считается некорректно.
			НоваяСтрока = ТабЗначРезультатЗапроса.Добавить();
			НоваяСтрока.APDEXbucket = bucket.Значение;
			Если ЗаписьЗамера.ВремяВыполнения <= BuketTime Тогда 			    
				НоваяСтрока.TotalAmount = 1; 
				Если ПерваяЗапись Тогда                                         
					НоваяСтрока.Amount = 1;
					НоваяСтрока.KeyOperationTime = ЗаписьЗамера.ВремяВыполнения;
					ПерваяЗапись = Ложь;		
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		ТабЗначРезультатЗапроса.Свернуть("APDEXbucket","TotalAmount,Amount,KeyOperationTime");
		
		НаборЗаписей = РегистрыСведений.APDEXMetrics.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.KeyOperation.Установить(КлючеваяОперация); 
		
		Для Каждого ТекСтрока Из ТабЗначРезультатЗапроса Цикл
			НоваяЗапись = НаборЗаписей.Добавить();                 
		   	НоваяЗапись.KeyOperation = КлючеваяОперация; 
		   	НоваяЗапись.APDEXbucket = ТекСтрока.APDEXbucket; 
		   	НоваяЗапись.TotalAmount = ТекСтрока.TotalAmount; 
			НоваяЗапись.Amount = ТекСтрока.Amount; 
			НоваяЗапись.KeyOperationTime = ТекСтрока.KeyOperationTime;
			НоваяЗапись.EditStamp = ТекущаяДата();
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла; 

 КонецПроцедуры
